YamashinaClosedEmpty/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.478;

boundaryField
{
    in
    {
        type            fixedValue;
        value           $internalField;
    }

    out
    {
        type            zeroGradient;
    }

    walls
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    si
    {
        type            symmetry;
    }

}


// ************************************************************************* //
